#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.rds.data.aws_availability_zones.available: Reading...
module.eks.aws_iam_role.carguero-technical-challenge-node-role: Refreshing state... [id=carguero-technical-challenge-node-role]
module.rds.aws_vpc.carguero-technical-challenger-db-vpc: Refreshing state... [id=vpc-0f5ebe29ad6533321]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Reading...
module.eks.data.aws_availability_zones.available: Reading...
module.eks.aws_vpc.carguero-technical-challenger-vpc: Refreshing state... [id=vpc-0e8856d5717fbf58b]
module.eks.data.aws_iam_policy_document.carguero-technical-challenge-assume-role: Read complete after 0s [id=3552664922]
module.eks.aws_iam_role.carguero-technical-challenge-iam-role: Refreshing state... [id=carguero-technical-challenge-role]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cluster-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506529200000004]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-service-policy: Refreshing state... [id=carguero-technical-challenge-role-20230618230506556900000005]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-cni-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506522100000003]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-registry-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506488500000001]
module.eks.aws_iam_role_policy_attachment.carguero-technical-challenge-node-policy: Refreshing state... [id=carguero-technical-challenge-node-role-20230618230506492700000002]
module.rds.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.data.aws_availability_zones.available: Read complete after 1s [id=us-east-1]
module.eks.aws_subnet.carguero-technical-challenger-subnet[0]: Refreshing state... [id=subnet-0150929ea866ddf53]
module.eks.aws_subnet.carguero-technical-challenger-subnet[1]: Refreshing state... [id=subnet-029f7804348303b71]
module.eks.aws_internet_gateway.carguero-technical-challenger-ig: Refreshing state... [id=igw-013916cb64494d713]
module.eks.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-06e1de82fbecb0abc]
module.rds.aws_security_group.carguero-technical-challenge-db-sg: Refreshing state... [id=sg-03ec0cd54d7729830]
module.rds.aws_internet_gateway.carguero-technical-challenger-db-ig: Refreshing state... [id=igw-0a103f683858d278f]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[1]: Refreshing state... [id=subnet-0f777c58cf88d761e]
module.rds.aws_subnet.carguero-technical-challenger-db-subnet[0]: Refreshing state... [id=subnet-073b8d2f78446906b]
module.eks.aws_route_table.carguero-technical-challenger-rt: Refreshing state... [id=rtb-005d7ca7ed3f7cd05]
module.rds.aws_route_table.carguero-technical-challenger-db-rt: Refreshing state... [id=rtb-0018cc55739d82717]
module.eks.aws_eks_cluster.carguero-technical-challenge: Refreshing state... [id=carguero-technical-challenge-cluster-2]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-0afe8d822d4172369]
module.eks.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0cce6e38f44a77697]
module.rds.aws_db_subnet_group.carguero-technical-challenge-db-subnet-group: Refreshing state... [id=carguero-technical-challenge-db-subnet-group]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[1]: Refreshing state... [id=rtbassoc-0fa260a94dbd6848f]
module.rds.aws_route_table_association.carguero-technical-challenger-rt-assoc[0]: Refreshing state... [id=rtbassoc-04308652869acc250]
module.rds.aws_db_instance.carguero-technical-challenge-db: Refreshing state... [id=db-DMLPOKWUYPKMJEQDPLIIF7RT4Y]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.eks.aws_eks_cluster.carguero-technical-challenge is tainted, so must be replaced
-/+ resource "aws_eks_cluster" "carguero-technical-challenge" {
      ~ arn                       = "arn:aws:eks:us-east-1:140280519783:cluster/carguero-technical-challenge-cluster-2" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUMvakNDQWVhZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJek1EWXhPVEF3TkRneE0xb1hEVE16TURZeE5qQXdORGd4TTFvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBT1d4Cm9hbUpuWkxSMzZMNXNMUmxrRStmOWJWbGsvQzNWSjRaelA0ZWJTYXB4TDlKMngydHBwcmRVYTQ3YWZ1ZG43aG4KQUtvakROZ0g5eHJueW80K1FoeXZ0NE1Ya2szMlhjOElTN2sxbitWYVpHVHVRdTExRUcrOTM4NmRmVTJhY2FydQowSi9IWHgzMGcyK3dUV1pObVdEVE9vSGFLQkRWR3Flc1JTM2pRNFJJMkF2Y3QvR1hCZ3BVaXY1cmhqZkx2R1ErCmtSemRPeUtCZFkxalBPV1gyeGovc3pmalM0cDgvVlR1ai9RZHkwM0pDTTUzdHRUb1FCdVJld1Vna2FWU1lnOGYKNjdra1oxem1hZ3ZPNEgwclF1WUMxTjR0ek5Pdy9LTTg2RHQrcVUrZEhDUVRZMFRuNHRSV0NuSHc3RCtUWWtWeAp2WWQ5azYvU01VMDlINGpuMDlNQ0F3RUFBYU5aTUZjd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZJdzBKQzFxODJvSHl0U3FBT3MwWklZTkVqVkNNQlVHQTFVZEVRUU8KTUF5Q0NtdDFZbVZ5Ym1WMFpYTXdEUVlKS29aSWh2Y05BUUVMQlFBRGdnRUJBSGNFL3cySHE1cWlFME5lWlpUKwpVNk1ERUxDcm4wSkVNVVhVWnJPS04wd0FkNTJid3NjSWsxRVVua3BIMm9WeWJHODlhZFlHaG53cDk4UGlab2pvCnVVTGFJM3pQNk9sYzdrTHlxN2IxRWx0Z2xKUWRSUDVRWkp2b0FJWjQ1RGlQSnpIdUZydkRRaE5WWXRnb0FaUk0KcG1Xdi9HOVBPVGREYmRWeXFqYkRpRUxLVU9vSGt2eUR1VVFJZUw5UUpiOEFKVlpBMWVNVjBKVkVnN0hEdFdSVQoyb1lGdldVK2xUamdBeEJTTTBOeEEvT3JqVk1GaFp2d3pDdFNGZXFyNnBHVzBnRXVBeDhXZjd6bC8wOVJtanNvCnZ5WjlkREdqVTU3cVJQYTlFZU02anhHdTYvbkZVMkhUSWdNRkJLZUVYNkNQTGU0Uy9MUE5qUmdsUWJvUUo4TDQKNXJJPQotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      + cluster_id                = (known after apply)
      ~ created_at                = "2023-06-19 00:42:03.102 +0000 UTC" -> (known after apply)
      - enabled_cluster_log_types = [] -> null
      ~ endpoint                  = "https://E61153FF20022A4550241042C2A3D9F3.gr7.us-east-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "carguero-technical-challenge-cluster-2" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.us-east-1.amazonaws.com/id/E61153FF20022A4550241042C2A3D9F3"
                    },
                ]
            },
        ] -> (known after apply)
      ~ name                      = "carguero-technical-challenge-cluster-2" -> "carguero-technical-challenge-cluster"
      ~ platform_version          = "eks.2" -> (known after apply)
      ~ status                    = "ACTIVE" -> (known after apply)
      - tags                      = {} -> null
        # (3 unchanged attributes hidden)

      - kubernetes_network_config {
          - ip_family         = "ipv4" -> null
          - service_ipv4_cidr = "172.20.0.0/16" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-0d6098bcf34a9d973" -> (known after apply)
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
            ] -> (known after apply)
          - security_group_ids        = [] -> null
          ~ vpc_id                    = "vpc-0e8856d5717fbf58b" -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

  # module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[0] will be created
  + resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "carguero-technical-challenge-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "carguero-technical-challenge-node-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::140280519783:role/carguero-technical-challenge-node-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0150929ea866ddf53",
          + "subnet-029f7804348303b71",
        ]
      + tags                   = {
          + "Name" = "carguero-technical-challenge-node-1"
        }
      + tags_all               = {
          + "Name"    = "carguero-technical-challenge-node-1"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }
    }

  # module.eks.aws_eks_node_group.carguero-technical-challenge-node-group[1] will be created
  + resource "aws_eks_node_group" "carguero-technical-challenge-node-group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "carguero-technical-challenge-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "carguero-technical-challenge-node-2"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::140280519783:role/carguero-technical-challenge-node-role"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0150929ea866ddf53",
          + "subnet-029f7804348303b71",
        ]
      + tags                   = {
          + "Name" = "carguero-technical-challenge-node-2"
        }
      + tags_all               = {
          + "Name"    = "carguero-technical-challenge-node-2"
          + "obs"     = "Managed by Terraform"
          + "owner"   = "Marcio Pacheco"
          + "project" = "carguero-technical-challenge"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 2
        }
    }

  # module.eks.helm_release.nginx-ingress-controller will be created
  + resource "helm_release" "nginx-ingress-controller" {
      + atomic                     = false
      + chart                      = "nginx-ingress-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress-controller"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://charts.bitnami.com/bitnami"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "9.7.2"
      + wait                       = true
      + wait_for_jobs              = false

      + set {
          + name  = "service.type"
          + value = "LoadBalancer"
        }
    }

Plan: 4 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @marciojpacheco, Action: `pull_request`, Working Directory: `terraform`, Workflow: `Terraform plan`*